__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          (None, 88, 38, 1)    0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 88, 38, 16)   160         the_input[0][0]                  
__________________________________________________________________________________________________
max1 (MaxPooling2D)             (None, 44, 19, 16)   0           conv1[0][0]                      
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 44, 19, 16)   2320        max1[0][0]                       
__________________________________________________________________________________________________
max2 (MaxPooling2D)             (None, 22, 9, 16)    0           conv2[0][0]                      
__________________________________________________________________________________________________
reshape (Reshape)               (None, 22, 144)      0           max2[0][0]                       
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 22, 512)      1345536     reshape[0][0]                    
__________________________________________________________________________________________________
lstm_1b (LSTM)                  (None, 22, 512)      1345536     reshape[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 22, 512)      0           lstm_1[0][0]                     
                                                                 lstm_1b[0][0]                    
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 22, 512)      2099200     add_1[0][0]                      
__________________________________________________________________________________________________
lstm_2b (LSTM)                  (None, 22, 512)      2099200     add_1[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 22, 1024)     0           lstm_2[0][0]                     
                                                                 lstm_2b[0][0]                    
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 22, 17)       17425       concatenate_1[0][0]              
__________________________________________________________________________________________________
the_labels (InputLayer)         (None, 7)            0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           dense2[0][0]                     
                                                                 the_labels[0][0]                 
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 6,909,377
Trainable params: 6,909,377
Non-trainable params: 0
__________________________________________________________________________________________________
